/********************************************************************************
* @classDescription 세션정보관리
* @author LDU.
* @version 1.0
* -------------------------------------------------------------------------------
* Modification Information
* Date              Developer           Content
* ----------        -------------       -------------------------
* 2023.01.06                   이동욱           			 신규생성 
* -------------------------------------------------------------------------------
* Copyright (C) 2023 by LDU. All rights reserved.
*********************************************************************************/

/********************************************************************************
 * Global constiable : 스크립트 영역에서 모두 접근할 수 있는 전역변수를 해당 영역에 모두 정의한다.
 ********************************************************************************/
var strSessionInfo = "";
var arraySessionInfo = new Array();

/********************************************************************************
 * Document Ready : jquery에서 제공하는 함수를 이용하여 화면이 로드될 때 처리할 함수를 정의한다.
 ********************************************************************************/
function initSession()
{
	//페이지 초기화 처리
	Session.initData();
};

/**
 * 클래스 구조의 스크립트 구조체 오브젝트 명을 정의한다.
 * 스크립트를 클래스 기반의 구조체로 정의하기 위해 해당 JavaScript의 클래스명은 파일명으로 정의한다.
 * @classDescription : 
 */
var Session={
//-------------------------------------------------------------------------------
// LOAD_DATA: 초기데이터 로드를 위한 함수 정의 [기본함수명:initData + (구분단어)]
//-------------------------------------------------------------------------------
	initData: function(){
		try {
			strSessionInfo = window.top.document.getElementById("txtSessionInfo").value;
			arraySessionInfo = strSessionInfo.split('|');
		}
		catch(e) {
			console.log("세션정보를 찾을 수 없습니다.");
		}
	},	
	
/********************************************************************************
 * User Functions: 별도 화면 처리를 위해 필요한 함수를 정의한다. 
 ********************************************************************************/

	/**
	 * 사용자 이메일 get
	 */
	getUserEmail : function() {
		return arraySessionInfo[0];
	},
	/**
	 * 사용자 고객사id get
	 */
	getCustChannelId : function() {
		return arraySessionInfo[1];
	},
	/**
	 * 사용자명 get
	 */
	getUsername : function() {
		return arraySessionInfo[2];
	},
	/**
	 * 사용자 권한cd get
	 */
	getAuthCd : function() {
		return arraySessionInfo[3];
	},

/********************************************************************************
 * function Sample
 ********************************************************************************/
	/**
	 * Sample(해당 함수는 삭제하지 말고 그대로)
	 */
	sample: function(){
		/*
		switch(strValue){
			case "caseA"	: ; break;
			case "caseB"	: ; break;
		}
		*/
	}
};
